In [2]:
import pandas as pd
import numpy as np

s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [0]:
df = pd.DataFrame({'total_bill': [16.99, 10.34, 23.68, 23.68, 24.59],
                   'tip': [1.01, 1.66, 3.50, 3.31, 3.61],
                   'sex': ['Female', 'Male', 'Male', 'Male', 'Female']})

In [8]:
df.dtypes
df.index
df.columns
df.values
df.shape

(5, 3)

In [0]:
dates = pd.date_range('20130101',periods = 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [0]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -1.321089  0.238801  0.850090  0.833603
2013-01-02 -1.783051  2.453829  0.203101 -0.099306
2013-01-03  0.416889  0.381790  1.169320  1.589493
2013-01-04 -0.309132  1.574709  0.505666  1.355547
2013-01-05 -0.010029 -1.810629  0.779344  0.337867
2013-01-06 -0.695331 -0.208925  0.585195  0.963289

In [0]:
col = list('ABCD')
col

['A', 'B', 'C', 'D']

In [0]:
df2 = pd.DataFrame({'A':1.,
                   'B':pd.Timestamp('20130102'),
                   'C':pd.Series(1,index=list(range(4)),dtype='float32'),
                   'D':np.array([3]*4,dtype='int32'),
                   'E':pd.Categorical(["test","train","test","train"]),
                   'F':'foo'})

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [0]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [0]:
df.head()

                   A         B         C         D
2013-01-01 -1.620992 -1.255061  0.542316  1.050026
2013-01-02  0.108518  1.174630 -0.730138  0.259597
2013-01-03  0.146063  0.669834 -0.258898  0.502883
2013-01-04  1.502114 -0.481438 -0.445906  1.857938
2013-01-05 -0.401894 -1.838668 -1.112530  0.156224

In [0]:
df.tail(3)

                   A         B         C         D
2013-01-04  1.502114 -0.481438 -0.445906  1.857938
2013-01-05 -0.401894 -1.838668 -1.112530  0.156224
2013-01-06  0.871891  1.022357 -0.184152 -0.197625

In [0]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [0]:
df.columns

Index([u'A', u'B', u'C', u'D'], dtype='object')

In [0]:
df.values

array([[-1.6209917 , -1.25506053,  0.5423155 ,  1.050026  ],
       [ 0.10851794,  1.17462952, -0.73013803,  0.25959749],
       [ 0.14606318,  0.66983372, -0.2588978 ,  0.5028833 ],
       [ 1.50211448, -0.48143807, -0.44590587,  1.85793802],
       [-0.4018942 , -1.83866791, -1.11253022,  0.15622359],
       [ 0.8718909 ,  1.02235741, -0.18415215, -0.19762506]])

In [0]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.100950 -0.118058 -0.364885  0.604841
std    1.074955  1.263145  0.559617  0.740708
min   -1.620992 -1.838668 -1.112530 -0.197625
25%   -0.274291 -1.061655 -0.659080  0.182067
50%    0.127291  0.094198 -0.352402  0.381240
75%    0.690434  0.934226 -0.202839  0.913240
max    1.502114  1.174630  0.542316  1.857938

In [0]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.620992    0.108518    0.146063    1.502114   -0.401894    0.871891
B   -1.255061    1.174630    0.669834   -0.481438   -1.838668    1.022357
C    0.542316   -0.730138   -0.258898   -0.445906   -1.112530   -0.184152
D    1.050026    0.259597    0.502883    1.857938    0.156224   -0.197625

In [0]:
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2013-01-01  1.050026  0.542316 -1.255061 -1.620992
2013-01-02  0.259597 -0.730138  1.174630  0.108518
2013-01-03  0.502883 -0.258898  0.669834  0.146063
2013-01-04  1.857938 -0.445906 -0.481438  1.502114
2013-01-05  0.156224 -1.112530 -1.838668 -0.401894
2013-01-06 -0.197625 -0.184152  1.022357  0.871891

In [0]:
df.sort_values(by=['B'])

                   A         B         C         D
2013-01-05 -0.401894 -1.838668 -1.112530  0.156224
2013-01-01 -1.620992 -1.255061  0.542316  1.050026
2013-01-04  1.502114 -0.481438 -0.445906  1.857938
2013-01-03  0.146063  0.669834 -0.258898  0.502883
2013-01-06  0.871891  1.022357 -0.184152 -0.197625
2013-01-02  0.108518  1.174630 -0.730138  0.259597

In [0]:
df['A']

2013-01-01   -1.620992
2013-01-02    0.108518
2013-01-03    0.146063
2013-01-04    1.502114
2013-01-05   -0.401894
2013-01-06    0.871891
Freq: D, Name: A, dtype: float64

In [0]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.620992 -1.255061  0.542316  1.050026
2013-01-02  0.108518  1.174630 -0.730138  0.259597
2013-01-03  0.146063  0.669834 -0.258898  0.502883

In [0]:
df['20130101':'20130102']

                   A         B         C         D
2013-01-01 -1.620992 -1.255061  0.542316  1.050026
2013-01-02  0.108518  1.174630 -0.730138  0.259597

In [0]:
a = dates[0]
df.loc[dates[0]]

A   -1.620992
B   -1.255061
C    0.542316
D    1.050026
Name: 2013-01-01 00:00:00, dtype: float64

In [0]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -1.620992 -1.255061
2013-01-02  0.108518  1.174630
2013-01-03  0.146063  0.669834
2013-01-04  1.502114 -0.481438
2013-01-05 -0.401894 -1.838668
2013-01-06  0.871891  1.022357

In [0]:
df.loc['20130101':'20130102',['A','B']]

                   A         B
2013-01-01 -1.620992 -1.255061
2013-01-02  0.108518  1.174630

In [0]:
df.loc['20130101',['A','B']]

A   -1.620992
B   -1.255061
Name: 2013-01-01 00:00:00, dtype: float64

In [0]:
df.loc[dates[0],'A']

-1.6209916987607436

In [0]:
df.at[dates[0],'A']

-1.6209916987607436

In [0]:
df.iloc[3]

A    1.502114
B   -0.481438
C   -0.445906
D    1.857938
Name: 2013-01-04 00:00:00, dtype: float64

In [0]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  1.502114 -0.481438
2013-01-05 -0.401894 -1.838668

In [0]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.108518 -0.730138
2013-01-03  0.146063 -0.258898
2013-01-05 -0.401894 -1.112530

In [0]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.108518  1.174630 -0.730138  0.259597
2013-01-03  0.146063  0.669834 -0.258898  0.502883

In [0]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -1.255061  0.542316
2013-01-02  1.174630 -0.730138
2013-01-03  0.669834 -0.258898
2013-01-04 -0.481438 -0.445906
2013-01-05 -1.838668 -1.112530
2013-01-06  1.022357 -0.184152

In [0]:
df.iloc[1,1]

1.1746295164248428

In [0]:
df.iat[1,1]

1.1746295164248428

In [0]:
df[df.A>0]

                   A         B         C         D
2013-01-02  0.108518  1.174630 -0.730138  0.259597
2013-01-03  0.146063  0.669834 -0.258898  0.502883
2013-01-04  1.502114 -0.481438 -0.445906  1.857938
2013-01-06  0.871891  1.022357 -0.184152 -0.197625

In [0]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN       NaN  0.542316  1.050026
2013-01-02  0.108518  1.174630       NaN  0.259597
2013-01-03  0.146063  0.669834       NaN  0.502883
2013-01-04  1.502114       NaN       NaN  1.857938
2013-01-05       NaN       NaN       NaN  0.156224
2013-01-06  0.871891  1.022357       NaN       NaN

In [0]:
df3 = df.copy()
df3['E'] = ['one','one','two','three','four','five']
df3

                   A         B         C         D      E
2013-01-01 -1.620992 -1.255061  0.542316  1.050026    one
2013-01-02  0.108518  1.174630 -0.730138  0.259597    one
2013-01-03  0.146063  0.669834 -0.258898  0.502883    two
2013-01-04  1.502114 -0.481438 -0.445906  1.857938  three
2013-01-05 -0.401894 -1.838668 -1.112530  0.156224   four
2013-01-06  0.871891  1.022357 -0.184152 -0.197625   five

In [0]:
df3[df3['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.146063  0.669834 -0.258898  0.502883   two
2013-01-05 -0.401894 -1.838668 -1.112530  0.156224  four

In [0]:
s1 = pd.Series([1,2,3,4,5,6],index = pd.date_range('20130102',periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [0]:
df['F'] = s1
df

                   A         B         C         D    F
2013-01-01 -1.321089  0.238801  0.850090  0.833603  NaN
2013-01-02 -1.783051  2.453829  0.203101 -0.099306  1.0
2013-01-03  0.416889  0.381790  1.169320  1.589493  2.0
2013-01-04 -0.309132  1.574709  0.505666  1.355547  3.0
2013-01-05 -0.010029 -1.810629  0.779344  0.337867  4.0
2013-01-06 -0.695331 -0.208925  0.585195  0.963289  5.0

In [0]:
df.at[dates[0],'A'] = 0
df.iat[0,1]=0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000  0.542316  1.050026  NaN
2013-01-02  0.108518  1.174630 -0.730138  0.259597  1.0
2013-01-03  0.146063  0.669834 -0.258898  0.502883  2.0
2013-01-04  1.502114 -0.481438 -0.445906  1.857938  3.0
2013-01-05 -0.401894 -1.838668 -1.112530  0.156224  4.0
2013-01-06  0.871891  1.022357 -0.184152 -0.197625  5.0

In [0]:
df.loc[:,'D'] = np.array([5]*len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.542316  5  NaN
2013-01-02  0.108518  1.174630 -0.730138  5  1.0
2013-01-03  0.146063  0.669834 -0.258898  5  2.0
2013-01-04  1.502114 -0.481438 -0.445906  5  3.0
2013-01-05 -0.401894 -1.838668 -1.112530  5  4.0
2013-01-06  0.871891  1.022357 -0.184152  5  5.0

In [0]:
df2 = df.copy()
df2[df2>0]=-df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.542316 -5  NaN
2013-01-02 -0.108518 -1.174630 -0.730138 -5 -1.0
2013-01-03 -0.146063 -0.669834 -0.258898 -5 -2.0
2013-01-04 -1.502114 -0.481438 -0.445906 -5 -3.0
2013-01-05 -0.401894 -1.838668 -1.112530 -5 -4.0
2013-01-06 -0.871891 -1.022357 -0.184152 -5 -5.0

In [0]:
df1 = df.reindex(index = dates[0:4],columns = list(df.columns)+['E'])
df1.loc[dates[0]:dates[1],'E']=1
df1

                   A         B         C         D    F    E
2013-01-01 -1.321089  0.238801  0.850090  0.833603  NaN  1.0
2013-01-02 -1.783051  2.453829  0.203101 -0.099306  1.0  1.0
2013-01-03  0.416889  0.381790  1.169320  1.589493  2.0  NaN
2013-01-04 -0.309132  1.574709  0.505666  1.355547  3.0  NaN

In [0]:
df1.dropna(how='any')

                   A         B         C         D    F    E
2013-01-02 -1.783051  2.453829  0.203101 -0.099306  1.0  1.0

In [0]:
df1.fillna(value=5)

                   A         B         C         D    F    E
2013-01-01 -1.321089  0.238801  0.850090  0.833603  5.0  1.0
2013-01-02 -1.783051  2.453829  0.203101 -0.099306  1.0  1.0
2013-01-03  0.416889  0.381790  1.169320  1.589493  2.0  5.0
2013-01-04 -0.309132  1.574709  0.505666  1.355547  3.0  5.0

In [0]:
pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [0]:
df.mean()

A   -0.616957
B    0.438263
C    0.682119
D    0.830082
F    3.000000
dtype: float64

In [0]:
df.mean(1)

2013-01-01    0.150351
2013-01-02    0.354915
2013-01-03    1.111498
2013-01-04    1.225358
2013-01-05    0.659311
2013-01-06    1.128846
Freq: D, dtype: float64

In [0]:
s = pd.Series([1,3,5,np.nan,6,8],index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [0]:
df.sub(s,axis='index')

                   A         B         C         D    F
2013-01-01       NaN       NaN       NaN       NaN  NaN
2013-01-02       NaN       NaN       NaN       NaN  NaN
2013-01-03 -0.583111 -0.618210  0.169320  0.589493  1.0
2013-01-04 -3.309132 -1.425291 -2.494334 -1.644453  0.0
2013-01-05 -5.010029 -6.810629 -4.220656 -4.662133 -1.0
2013-01-06       NaN       NaN       NaN       NaN  NaN

In [0]:
df.apply(np.cumsum)

                   A         B         C         D     F
2013-01-01 -1.321089  0.238801  0.850090  0.833603   NaN
2013-01-02 -3.104141  2.692630  1.053190  0.734298   1.0
2013-01-03 -2.687252  3.074420  2.222510  2.323790   3.0
2013-01-04 -2.996384  4.649130  2.728176  3.679337   6.0
2013-01-05 -3.006414  2.838501  3.507520  4.017205  10.0
2013-01-06 -3.701745  2.629575  4.092715  4.980494  15.0

In [0]:
df.apply(lambda x:x.max()-x.min())

A    2.199940
B    4.264458
C    0.966219
D    1.688798
F    4.000000
dtype: float64

In [0]:
s = pd.Series(np.random.randint(0,7,size=10))
s
s.value_counts()

5    3
6    2
3    2
1    2
2    1
dtype: int64

In [0]:
s = pd.Series(['A','b',np.nan,'Zoo'])
s.str.lower()

0      a
1      b
2    NaN
3    zoo
dtype: object

In [0]:
df = pd.DataFrame(np.random.randn(10,4))
df
pieces=[df[:3],df[3:7],df[7:]]
pieces
pd.concat(pieces)

          0         1         2         3
0  0.167322  0.255274 -0.517351  0.576317
1 -0.333373  0.355930  0.622111 -1.991094
2  1.160651  0.123058  0.750610  0.005141
3  1.420931 -0.597064 -0.653332 -0.821243
4 -0.231473 -0.616548 -0.259622 -0.339596
5 -0.094038 -0.589818 -0.104433  1.873249
6  0.887051  0.328000  1.307583  1.722761
7 -0.603105 -1.903393 -0.390653  1.262644
8 -0.985885  1.494969 -0.037523  0.354343
9  0.789825  0.251882  0.177619  1.141129

In [0]:
left = pd.DataFrame({'key':['foo','foo'],'lval':[1,2]})
right = pd.DataFrame({'key':['foo','foo'],'rval':[4,5]})
print left
print right

   key  lval
0  foo     1
1  foo     2
   key  rval
0  foo     4
1  foo     5

In [0]:
pd.merge(left,right,on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [0]:
df = pd.DataFrame(np.random.randn(8,4),columns=['A','B','C','D'])
df

          A         B         C         D
0 -2.424901  0.165901 -1.735809 -0.936549
1  0.646017  1.194361  0.066393 -2.808754
2 -0.668425 -1.255281 -0.769340 -2.043201
3  0.440904  0.847900  0.997143 -0.765167
4 -0.021888 -0.777663  0.834270 -0.941428
5  0.961929 -0.728217  0.433482 -2.089846
6 -1.537739  2.308719  0.095189  0.342524
7 -0.265976  0.668162 -0.366181 -0.284529

In [0]:
s = df.iloc[3]
df.append(s,ignore_index=True)

          A         B         C         D
0 -2.424901  0.165901 -1.735809 -0.936549
1  0.646017  1.194361  0.066393 -2.808754
2 -0.668425 -1.255281 -0.769340 -2.043201
3  0.440904  0.847900  0.997143 -0.765167
4 -0.021888 -0.777663  0.834270 -0.941428
5  0.961929 -0.728217  0.433482 -2.089846
6 -1.537739  2.308719  0.095189  0.342524
7 -0.265976  0.668162 -0.366181 -0.284529
8  0.440904  0.847900  0.997143 -0.765167

In [0]:
df = pd.DataFrame({'A':['foo','bar','foo','bar',
                       'foo','bar','foo','bar'],
                   'B':['one','one','two','three',
                       'two','two','one','three'],
                   'C':np.random.randn(8),
                   'D':np.random.randn(8)
                  })
df

     A      B         C         D
0  foo    one -1.054405  1.354575
1  bar    one  0.417249 -0.213798
2  foo    two  2.193068 -0.002561
3  bar  three  0.416475 -0.956096
4  foo    two -1.198165 -0.667392
5  bar    two -0.600790 -0.550899
6  foo    one -0.056549  1.405969
7  bar  three -1.297545 -0.613981

In [0]:
df.groupby('A').sum()

            C         D
A
bar -1.064611 -2.334774
foo -0.116051  2.090592

In [0]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    0.417249 -0.213798
    three -0.881070 -1.570078
    two   -0.600790 -0.550899
foo one   -1.110954  2.760545
    two    0.994903 -0.669953

In [0]:
tuples = list(zip(*[['bar','bar','baz','baz','foo','foo','quz','quz'],
      ['one','two','one','two','one','two','one','two']]))

index = pd.MultiIndex.from_tuples(tuples,names=['first','second'])

df = pd.DataFrame(np.random.randn(8,2),index=index,columns=['A','B'])

df

                     A         B
first second
bar   one     0.036437 -0.565147
      two     0.122068 -0.260710
baz   one    -0.333542 -2.723581
      two     0.886391 -0.011198
foo   one    -1.257910 -1.178678
      two     1.207816 -0.556158
quz   one    -0.088058  1.051124
      two    -0.954071  0.048336

In [0]:
df2 = df[:4]
stacked = df2.stack()
stacked

first  second
bar    one     A    0.036437
               B   -0.565147
       two     A    0.122068
               B   -0.260710
baz    one     A   -0.333542
               B   -2.723581
       two     A    0.886391
               B   -0.011198
dtype: float64

In [0]:
stacked.unstack()

                     A         B
first second
bar   one     0.036437 -0.565147
      two     0.122068 -0.260710
baz   one    -0.333542 -2.723581
      two     0.886391 -0.011198

In [0]:
stacked.unstack(0)

first          bar       baz
second
one    A  0.036437 -0.333542
       B -0.565147 -2.723581
two    A  0.122068  0.886391
       B -0.260710 -0.011198